package com.company;
/*
集合中讲的登录注册案例，上一次注册的信息，一运行没啦，因为我们上一次是通过集合存储的数据，
而集合将这个数据存储到这里面之后，程序一结束，它就消失啦--》因为
集合是在我们程序运行的时候启动的，然后我们创建了对象，然后这个对象其实把数据存在内存中啦，当程序一结束，虚拟机一结束内存中的东西都消失啦，所以数据没存下来
这种东西只适合做一些临时性的数据存储，而我们想要的是永久性的数据存储
而想要永久存储，就得使用IO流（Input存数据，output取数据）    文件表达问题（File）和异常的处理（异常）
文件可以对数据进行永久性存储
要想做永久性存储，以及下一次将数据从文件中读出来，就要学IO流技术
IO流（两种最常见的技术操作）：
    上传操作；IO读取客户端数据，写到服务器
    下载操作：IO读取服务器数据，显示到客户端   （迅雷）
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
