package com.company;
/*
@类与对象的关系
   类：   变量（属性）      方法（行为）
      是一组相关属性和行为的集合，是抽象的概念
   对象：是该类事物的具体表现形式，具体存在的个体
   事物：                            类：
       属性（该事物的描述信息）          成员变量
       行为 （事物的功能）                            成员方法
   对象的创建： 类名 对象名=new 类名（）；
                Student s=new Student（）；
   变量（variable） ：成员变量：在堆内存--》有默认值
                     局部变量：在栈内存--》必须定义，赋值，才可调用
              生命周期不同：成员边量：随着对象的创建而存在，随着对象消失而消失
                            局部变量：随着方法调用而存在，随着方法调用完毕而消失
               注意:局部变量名称可以和成员变量名称一样，在方法中使用的时候采用的是就近原则
                   如果看到了一个方法的形式参数是一个类类型（引用类型）这里其实需要的是一个该类的对象
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
